InformationRegisters/ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ДБ_ОбщийМодуль/Ext/Module.bsl
Функция СотрудникиСИстекующимПатентомНаСервере()
		
	Если НЕ Константы.ДБ_УвеломлятьОЗавершенииСроковДействияСтатусовНалогоплательщиковНДФЛ.Получить() Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия
	|ПОМЕСТИТЬ ДействующиеСотрудники
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = &ВидСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеСотрудники.Сотрудник КАК Сотрудник,
	|	ДействующиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ДействуетДо КАК ДействуетДо,
	|	РАЗНОСТЬДАТ(&ТекущаяДата, ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ДействуетДо, ДЕНЬ) КАК ОсталосьДней
	|ИЗ
	|	ДействующиеСотрудники КАК ДействующиеСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ КАК ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ
	|		ПО (ДействующиеСотрудники.ФизическоеЛицо = ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ФизическоеЛицо)
	|ГДЕ
	|	РАЗНОСТЬДАТ(&ТекущаяДата, ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ДействуетДо, ДЕНЬ) < 30";
	
	Запрос.УстановитьПараметр("ВидСобытия", Перечисления.ВидыКадровыхСобытий.Увольнение);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции // ФизическиеЛицаСИстекующимПатентомНаСервере()

Функция СотрудникиСИстекующимПатентом() Экспорт
	Возврат СотрудникиСИстекующимПатентомНаСервере();
КонецФункции // ФизическиеЛицаСИстекующимПатентом()
